---
kind: type
id: T:Autodesk.Revit.UI.Events.ViewActivatedEventArgs
source: html/3c54cedc-bdbd-fb2c-2250-cb7387a5c3d4.htm
---
# Autodesk.Revit.UI.Events.ViewActivatedEventArgs

The event arguments used by the ViewActivated event.

## Syntax (C#)
```csharp
public class ViewActivatedEventArgs : RevitAPIPostDocEventArgs
```